In [2]:
import pandas as pd
import numpy as np

In [3]:
dados = pd.read_json("../Dados_desafios/dados_vendas_clientes.json")

dados = pd.json_normalize(dados["dados_vendas"])

In [4]:
dados

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [5]:
colunas = list(dados.columns)
colunas

['Data de venda', 'Cliente', 'Valor da compra']

In [6]:
dados = dados.explode(colunas[2:])

In [7]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 0 to 4
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     object
dtypes: object(3)
memory usage: 640.0+ bytes

In [8]:
dados.reset_index(inplace=True, drop=True)

In [9]:
dados.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 836,5"
1,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 573,33"
2,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 392,8"
3,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","R$ 512,34"
4,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","R$ 825,31"

In [10]:
dados["Valor da compra"] = dados["Valor da compra"].apply(lambda x: x.replace("R$", "").replace(",", ".").strip())

In [11]:
dados["Valor da compra"] = dados["Valor da compra"].astype(np.float64)

In [42]:
dados["Cliente"] = dados["Cliente"].str.lower()

In [58]:
dados['Cliente'] = dados['Cliente'].str.replace('[^a-zA-Z0-9\-\']', ' ', regex=True)
dados['Cliente'] = dados['Cliente'].str.replace('(?<!\w)-(?!\w)', '', regex=True)

<>:1: SyntaxWarning: invalid escape sequence '\-'
<>:2: SyntaxWarning: invalid escape sequence '\w'
<>:1: SyntaxWarning: invalid escape sequence '\-'
<>:2: SyntaxWarning: invalid escape sequence '\w'
C:\Users\jpgtr\AppData\Local\Temp\ipykernel_42472\2584211067.py:1: SyntaxWarning: invalid escape sequence '\-'
  dados['Cliente'] = dados['Cliente'].str.replace('[^a-zA-Z0-9\-\']', ' ', regex=True)
C:\Users\jpgtr\AppData\Local\Temp\ipykernel_42472\2584211067.py:2: SyntaxWarning: invalid escape sequence '\w'
  dados['Cliente'] = dados['Cliente'].str.replace('(?<!\w)-(?!\w)', '', regex=True)

In [60]:
dados["Cliente"].str.split()

0     [', ana, lucia, 321', 'diego, armandiu, 210', ...
1     [', ana, lucia, 321', 'diego, armandiu, 210', ...
2     [', ana, lucia, 321', 'diego, armandiu, 210', ...
3     [', ana, lucia, 321', 'diego, armandiu, 210', ...
4     ['isabely, joanes, 738', 'isabely, joanes, 738...
5     ['isabely, joanes, 738', 'isabely, joanes, 738...
6     ['isabely, joanes, 738', 'isabely, joanes, 738...
7     ['isabely, joanes, 738', 'isabely, joanes, 738...
8     ['isabely, joanes, 738', 'jo, o, gabriel, 671'...
9     ['isabely, joanes, 738', 'jo, o, gabriel, 671'...
10    ['isabely, joanes, 738', 'jo, o, gabriel, 671'...
11    ['isabely, joanes, 738', 'jo, o, gabriel, 671'...
12    ['julya, meireles, 914', 'maria, julia, 444', ...
13    ['julya, meireles, 914', 'maria, julia, 444', ...
14    ['julya, meireles, 914', 'maria, julia, 444', ...
15    ['julya, meireles, 914', 'maria, julia, 444', ...
16    ['maria, julia, 444', 'pedro, pasco, 812', 'pa...
17    ['maria, julia, 444', 'pedro, pasco, 812', 'pa...
18    ['maria, julia, 444', 'pedro, pasco, 812', 'pa...
19    ['maria, julia, 444', 'pedro, pasco, 812', 'pa...
Name: Cliente, dtype: object

In [61]:
dados['Data de venda'] = pd.to_datetime(dados['Data de venda'], format='%d/%m/%Y')
total_compras = dados.groupby(['Cliente'])['Valor da compra'].sum()

In [63]:
dados.head()

,Data de venda,Cliente,Valor da compra
0,2022-06-06,' ana lucia 321' 'diego armandiu 210' 'die...,836.50
1,2022-06-06,' ana lucia 321' 'diego armandiu 210' 'die...,573.33
2,2022-06-06,' ana lucia 321' 'diego armandiu 210' 'die...,392.80
3,2022-06-06,' ana lucia 321' 'diego armandiu 210' 'die...,512.34
4,2022-06-07,'isabely joanes 738' 'isabely joanes 738' '...,825.31